#### ITransientElementMaker Members

---

|  |
| --- |
| ITransientElementMaker Interface   Methods   See Also |

The  ITransientElementMaker  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Execute | Implement this method to create transient elements. |

# See Also

ITransientElementMaker Interface

Autodesk.Revit.DB Namespace